Repository: codeworxOS/identity
Catalog: src/Codeworx.Identity/Resources/Translation.*.resx
Languages: de

# AcceptInvitationPageTitle
source: Accept Invitation
de: Einladung annehmen

source: Change password
de: Passwort ändern

# ChangePasswordPageTitle
source: Change Password
de: Passwort ändern

source: Confirm password
de: Passwort wiederholen

source: Continue
de: Weiter

source: Current password
de: aktuelles Passwort

# DefaultAuthenticationError
source: Username or password incorrect.
de: Benutzername oder Passwort falsch.

# ExternalAccountAlreadyLinkedError
source: The external account is already linked to a different user.
de: Das externe Konto ist bereits mit einem anderen Benutzer verknüpft.

# ExternalAccountNotLinkedError
source: Your Account is not yet linked.
de: Ihr Konto ist noch nicht verknüpft.

source: Forgot password?
de: Passwort vergessen?

# ForgotPasswordCompletedMessage
source: If an account exists that maches the given credentials, password reset instructions will be sent to you.
de: Wenn ein Konto für die angegebenen Anmeldeinformationen vorhanden ist werden Ihnen Anweisungen zum Zurücksetzen des Passworts zugesandt.

# ForgotPasswordPageTitle
source: Forgot Password
de: Passwort vergessen

# GenericLoginError
source: There was an unexpected login error!
de: Es ist ein unerwarteter Anmeldefehler aufgetreten!

# Http401Description
source: This normally indicates that your browser does not support Windows authentication, wrong credentials were provided or Windows authentication support is disabled.
de: Dies weist normalerweise darauf hin, dass Ihr Browser die Windows-Authentifizierung nicht unterstützt, falsche Anmeldeinformationen angegeben wurden oder die Unterstützung für Windows-Authentifizierung deaktiviert ist.

# Http401Header
source: Oops! You could not be authenticated
de: Hoppla! Sie konnten nicht authentifiziert werden

# Http401PageTitle
source: 401 Unauthenticated
de: 401 Nicht Authentifiziert

# InvitationCodeExpiredError
source: The invitation code is expired!
de: Der Einladungscode ist abgelaufen!

# InvitationCodeInvalidError
source: The invitation code is invalid!
de: Der Einladungscode ist ungültig!

# InvitationCodeRedeemedError
source: The invitation code is no longer valid!
de: Der Einladungscode ist nicht mehr gültig!

# InvitationNotSupportedError
source: Invitation feature is not supported!
de: Einladungsfunktion wird nicht unterstützt!

# JavascriptErrorMessage
source: JavaScript is disabled. We strongly recommend to enable it. Click the button below to continue.
de: JavaScript ist deaktiviert. Wir empfehlen Ihnen es zu aktivieren. Klicken Sie auf die Schaltfläche unten um fortzufahren.

# LanguageCode
source: en
de: de

source: Login
de: Anmelden

# LoginPageTitle
source: Login
de: Anmeldung

source: New password
de: neues Passwort

source: or connect with
de: oder verbinden mit

source: or login with
de: oder anmelden mit

source: Password
de: Kennwort

# PasswordChangeEqualToLoginError
source: The new password cannot be equal to the login!
de: Das neue Passwort darf nicht gleich dem Benutzernamen sein!

# PasswordChangeNotMatchingError
source: Passwords do not match!
de: Passwörter stimmen nicht überein!

# PasswordChangeSamePasswordError
source: The new password cannot be equal to the current password!
de: Das neue Passwort darf nicht gleich dem aktuellen Passwort sein!

# PasswordChangeWrongPasswordError
source: Wrong password!
de: Falsches Passwort!

# ProfilePageTitle
source: Profile
de: Benutzerprofil

source: Remember me
de: Anmeldedaten speichern

# ResetPassword
source: Reset
de: Ändern

source: Return to login
de: Zurück zur Anmeldung

source: Save
de: Speichern

source: Select
de: Auswählen

# SelectTenantPageTitle
source: Select Tenant
de: Mandant auswählen

source: Set as default
de: Als Standard festlegen

source: Set Password
de: Passwort vergeben

# SetPasswordPageTitle
source: Set Password
de: Passwort vergeben

# UnknownLoginProviderError
source: Invalid provider!
de: Ungültiger Anmeldungsmechanismus!

# UserForClientP0NotFoundError
source: The User provided for client {0} could not be found.
de: Der Benutzer für die Anwendung {0} konnte nicht gefunden werden.

source: Username
de: Benutzer

# MaxFailedLoginAttemptsReached
source: The account is locked because a wrong password was entered too often.
de: Der Account ist gesperrt weil das Passwort zu oft falsch eingegeben wurde.

# PasswordChangePasswordReuseError
source: The new password cannot be equal to a previously used password!
de: Das neue Passwort darf nicht mit vorherigen Passwörtern übereinstimmen!

# UsernameAlreadyTaken
source: The provided username is already taken.
de: Der Benutzername ist bereits vergeben.

# ConfirmationCodeInvalid
source: The provided confirmation code is invalid.
de: Der angegebene Bestätigungscode ist ungültig.

# ConfirmationPageTitle
source: Account Confirmation
de: Konto bestätigung

# ConfirmationMessage
source: Welcome {0}. Your account is now confirmed.
de: Wilkommen {0}. Ihr Account ist nun aktiviert.

# AccountConfirmationPending
source: The account has not yet been confirmed.
de: Ihr Konto wurde noch nicht bestätigt.

# EmailLoginDescription
source: The username must be a valid email address.
de: Der Benutzername muss eine gültige E-Mail Adresse sein.

# InvalidOneTimeCode
source: The One-Time code is invalid!
de: Der Einmalcode ist ungültig!

source: One-Time code
de: Einmalcode

# ProvideOneTimeCode
source: Enter your 6 digit code:
de: Einmalcode eingeben:

# SendCode
source: Send
de: Senden

# OneTimeCodeMailSent
source: A one-time code has been sent to the registered email address:
de: Ein Einmalcode wurde an die registrierte e-mail Adresse gesendet:

# RegisterMfaEmail
source: Please enter an e-mail address to receive the one-time code with.
de: Legen Sie die E-Mail Adresse fest mit der Sie ihre Einmalcodes empfangen möchten.

# ConnectAuthenticatorApp
source: Register your account with an authenticator app.
de: Verbinden Sie Ihren Account mit einer Authenticator App.

# MfaProviderListPageTitle
source: Validate your identity
de: Identitätsüberprüfung

# MfaProviderPageTitle
source: Multi Step Verification
de: Multi-Faktor-Authentifizierung

# ReceiveCodeFromApp
source: Use the connected authenticator app to get a one-time code.
de: Verwenden Sie die registrierte Authenticator app um einen Einmalcode zu generieren.

# UnlinkProvider
source: Unlink
de: Trennen

# TotpRegistrationUrl
source: Register via URL
de: Ristrierungslink

# DidNotReceiveCode
source: Did not receive a code?
de: Sie haben keinen Code erhalten?

# MfaProviderSelectLink
source: Chose another option.
de: Andere Optionen

# OneTimeCodeViaApp
source: One-time code via authenticator app
de: Einmalcode mit Authenticator App

# OneTimeCodeViaEmail
source: Code via e-mail sent to {0}
de: Code via e-mail an {0}

# MfaListRegisterMail
source: Register with an e-mail address
de: Registrierung mittels E-Mail Adresse

source: e-mail address
de: E-Mail Adresse

# MfaListRegisterTotp
source: Register with your authenticator app
de: Registrierung mittels Authenicator App.

# MfaProviderCancel
source: Cancel
de: Abbrechen

# ConfirmationBack
source: Back
de: Zurück
